hybridCentralSolvers/Tutorials/gasMixture/counterFlowFlame2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|U|h|p|Yi).*"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-015;
        relTol          0.0;
    }
}

PIMPLE
{
                                
    momentumPredictor           false; //true;
    nCorrectors                 3;
    nOuterCorrectors            1;
    nonOrthogonalityThreshold   60;
    skewnessThreshold           0.5;
    updateEnergyInPISO          false;
    fluxScheme                  Kurganov; //Tadmor;
    
    kappaFunction
    {
        type standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
        }
    }
}

// ************************************************************************* //
